const data = [{
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "8",
    "中位数": "1.09"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "18",
    "中位数": "1.52"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "46",
    "中位数": "1.92"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "45",
    "中位数": "2.43"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "80",
    "中位数": "3.2"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "113",
    "中位数": "3.81"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "68",
    "中位数": "4.28"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "255",
    "中位数": "4.6"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "478",
    "中位数": "5.3"
  },
  {
    "学科": "基础科学",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "215",
    "中位数": "5.69"
  },
  
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "5",
    "中位数": "1.09"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "51",
    "中位数": "1.67"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "78",
    "中位数": "1.96"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "121",
    "中位数": "2.54"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "96",
    "中位数": "3.24"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "186",
    "中位数": "3.94"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "226",
    "中位数": "4.45"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "322",
    "中位数": "4.63"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "267",
    "中位数": "5.44"
  },
  {
    "学科": "工程科技",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "167",
    "中位数": "6.58"
  },
  
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "4",
    "中位数": "1.1"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "11",
    "中位数": "1.57"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "31",
    "中位数": "2.11"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "43",
    "中位数": "2.57"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "48",
    "中位数": "3.55"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "67",
    "中位数": "4.36"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "134",
    "中位数": "4.66"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "50",
    "中位数": "4.72"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "75",
    "中位数": "5.29"
  },
  {
    "学科": "农业科技",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "107",
    "中位数": "5.62"
  },
  
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "6",
    "中位数": "1.08"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "15",
    "中位数": "1.51"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "44",
    "中位数": "1.86"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "45",
    "中位数": "2.14"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "106",
    "中位数": "2.73"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "52",
    "中位数": "3.08"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "58",
    "中位数": "3.16"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "93",
    "中位数": "3.05"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "113",
    "中位数": "3.16"
  },
  {
    "学科": "医药卫生科技",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "96",
    "中位数": "3.24"
  },
  
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "4",
    "中位数": "1.09"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "40",
    "中位数": "1.5"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "40",
    "中位数": "1.94"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "92",
    "中位数": "2.45"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "117",
    "中位数": "3.3"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "101",
    "中位数": "3.74"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "209",
    "中位数": "4.37"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "160",
    "中位数": "4.59"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "126",
    "中位数": "5.24"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "137",
    "中位数": "5.66"
  },
  
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "10",
    "中位数": "1.21"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "69",
    "中位数": "1.92"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "78",
    "中位数": "2.18"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "146",
    "中位数": "2.5"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "539",
    "中位数": "3.25"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "217",
    "中位数": "3.63"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "189",
    "中位数": "3.86"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "150",
    "中位数": "3.92"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "489",
    "中位数": "4.74"
  },
  {
    "学科": "社会科学",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "326",
    "中位数": "4.81"
  },
  
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "8",
    "中位数": "1.12"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "51",
    "中位数": "1.94"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "52",
    "中位数": "2.44"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "109",
    "中位数": "3.17"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "154",
    "中位数": "3.77"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "180",
    "中位数": "4.79"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "239",
    "中位数": "4.89"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "389",
    "中位数": "4.97"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "383",
    "中位数": "5.92"
  },
  {
    "学科": "信息科技",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "297",
    "中位数": "6.44"
  },
  
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2018",
    "最大数": "5",
    "中位数": "1.13"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2017",
    "最大数": "37",
    "中位数": "1.83"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2016",
    "最大数": "99",
    "中位数": "2.32"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2015",
    "最大数": "93",
    "中位数": "2.9"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2014",
    "最大数": "133",
    "中位数": "3.84"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2013",
    "最大数": "167",
    "中位数": "4.26"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2012",
    "最大数": "226",
    "中位数": "4.65"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2011",
    "最大数": "178",
    "中位数": "4.59"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2010",
    "最大数": "189",
    "中位数": "5.58"
  },
  {
    "学科": "经济与管理科学",
    "层次": "硕士",
    "年份": "2009",
    "最大数": "215",
    "中位数": "5.73"
  },
  
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2018",
    "最大数": "3",
    "中位数": "1.11"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2017",
    "最大数": "26",
    "中位数": "1.96"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2016",
    "最大数": "35",
    "中位数": "2.68"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2015",
    "最大数": "36",
    "中位数": "3.58"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2014",
    "最大数": "61",
    "中位数": "5.3"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2013",
    "最大数": "163",
    "中位数": "7.33"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2012",
    "最大数": "106",
    "中位数": "7.71"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2011",
    "最大数": "106",
    "中位数": "8.22"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2010",
    "最大数": "108",
    "中位数": "8.98"
  },
  {
    "学科": "基础科学",
    "层次": "博士",
    "年份": "2009",
    "最大数": "276",
    "中位数": "10.34"
  },
  
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2018",
    "最大数": "6",
    "中位数": "1.14"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2017",
    "最大数": "19",
    "中位数": "2.1"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2016",
    "最大数": "37",
    "中位数": "3.24"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2015",
    "最大数": "57",
    "中位数": "4.54"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2014",
    "最大数": "460",
    "中位数": "7.63"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2013",
    "最大数": "209",
    "中位数": "10.33"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2012",
    "最大数": "190",
    "中位数": "12.47"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2011",
    "最大数": "236",
    "中位数": "12.3"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2010",
    "最大数": "158",
    "中位数": "13.59"
  },
  {
    "学科": "工程科技",
    "层次": "博士",
    "年份": "2009",
    "最大数": "394",
    "中位数": "15.69"
  },
  
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2018",
    "最大数": "4",
    "中位数": "1.07"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2017",
    "最大数": "18",
    "中位数": "2.29"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2016",
    "最大数": "18",
    "中位数": "3.18"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2015",
    "最大数": "53",
    "中位数": "4.28"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2014",
    "最大数": "116",
    "中位数": "6.76"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2013",
    "最大数": "91",
    "中位数": "8.71"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2012",
    "最大数": "149",
    "中位数": "9.02"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2011",
    "最大数": "142",
    "中位数": "9.23"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2010",
    "最大数": "384",
    "中位数": "9.73"
  },
  {
    "学科": "农业科技",
    "层次": "博士",
    "年份": "2009",
    "最大数": "126",
    "中位数": "10.79"
  },
  
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2018",
    "最大数": "3",
    "中位数": "1.14"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2017",
    "最大数": "31",
    "中位数": "1.84"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2016",
    "最大数": "50",
    "中位数": "2.31"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2015",
    "最大数": "64",
    "中位数": "2.73"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2014",
    "最大数": "114",
    "中位数": "4.08"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2013",
    "最大数": "93",
    "中位数": "4.69"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2012",
    "最大数": "133",
    "中位数": "5"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2011",
    "最大数": "82",
    "中位数": "4.56"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2010",
    "最大数": "87",
    "中位数": "4.41"
  },
  {
    "学科": "医药卫生科技",
    "层次": "博士",
    "年份": "2009",
    "最大数": "79",
    "中位数": "4.66"
  },
  
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2018",
    "最大数": "7",
    "中位数": "1.28"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2017",
    "最大数": "21",
    "中位数": "2.17"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2016",
    "最大数": "36",
    "中位数": "2.93"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2015",
    "最大数": "39",
    "中位数": "4.2"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2014",
    "最大数": "138",
    "中位数": "7.42"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2013",
    "最大数": "149",
    "中位数": "8.99"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2012",
    "最大数": "188",
    "中位数": "10.39"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2011",
    "最大数": "201",
    "中位数": "10.12"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2010",
    "最大数": "222",
    "中位数": "11.99"
  },
  {
    "学科": "哲学与人文科学",
    "层次": "博士",
    "年份": "2009",
    "最大数": "146",
    "中位数": "11.98"
  },
  
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2018",
    "最大数": "8",
    "中位数": "1.51"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2017",
    "最大数": "57",
    "中位数": "3.65"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2016",
    "最大数": "54",
    "中位数": "4.49"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2015",
    "最大数": "102",
    "中位数": "5.75"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2014",
    "最大数": "178",
    "中位数": "10.23"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2013",
    "最大数": "645",
    "中位数": "12.93"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2012",
    "最大数": "308",
    "中位数": "13.63"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2011",
    "最大数": "228",
    "中位数": "13.41"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2010",
    "最大数": "204",
    "中位数": "14.34"
  },
  {
    "学科": "社会科学",
    "层次": "博士",
    "年份": "2009",
    "最大数": "236",
    "中位数": "13.4"
  },
  
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2018",
    "最大数": "6",
    "中位数": "1.23"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2017",
    "最大数": "57",
    "中位数": "2.62"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2016",
    "最大数": "44",
    "中位数": "3.21"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2015",
    "最大数": "54",
    "中位数": "4.24"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2014",
    "最大数": "126",
    "中位数": "7.03"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2013",
    "最大数": "293",
    "中位数": "10.77"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2012",
    "最大数": "221",
    "中位数": "12.04"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2011",
    "最大数": "279",
    "中位数": "10.79"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2010",
    "最大数": "435",
    "中位数": "12.33"
  },
  {
    "学科": "信息科技",
    "层次": "博士",
    "年份": "2009",
    "最大数": "419",
    "中位数": "14.21"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2018",
    "最大数": "6",
    "中位数": "1.25"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2017",
    "最大数": "27",
    "中位数": "3.23"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2016",
    "最大数": "75",
    "中位数": "4.53"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2015",
    "最大数": "192",
    "中位数": "5.75"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2014",
    "最大数": "460",
    "中位数": "10.82"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2013",
    "最大数": "182",
    "中位数": "14.12"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2012",
    "最大数": "226",
    "中位数": "15.21"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2011",
    "最大数": "183",
    "中位数": "15.12"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2010",
    "最大数": "315",
    "中位数": "14.96"
  },
  {
    "学科": "经济与管理科学",
    "层次": "博士",
    "年份": "2009",
    "最大数": "276",
    "中位数": "16.99"
  },
];